'''------------------------------------------------------
【程序填空】
---------------------------------------------------------
输入年月日，输出这是这一年的第几天；
------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
------------------------------------------------------'''
# **********SPACE**********
year = int(input("请输入年份:"))  # todo
month = input("请输入月份:")
day = int(input('请输入日期:'))
dic = {"1": 31, "2": 28, "3": 31, "4": 30, "5": 31, "6": 30, "7": 31,
       "8": 31, "9": 30, "10": 31, "11": 30, "12": 31}
# **********SPACE**********
days = 0  # todo
if ((year % 4 == 0) and (year % 100 != 0)) or (year % 400 == 0):
    dic["2"] = 29
if int(month) > 1:
    for obj in dic:
        if month == obj:
            for i in range(1, int(obj)):
                days += dic[str(i)]
    days += day
else:
    days = day
print('{}年{}月{}日是该年的第{}天'.format(year, month, day, days))
