'''------------------------------------------------------
【程序填空】
---------------------------------------------------------
建立空字典，输入全班20名学生的姓名和年龄，分别输出年龄最大值，以及全班的平均年龄；
------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
------------------------------------------------------'''
# **********SPACE**********
s = {}  # todo
for i in range(20):
    name = input("输入姓名：")
    age = int(input("年龄："))
    s[name] = age
print(s)
# **********SPACE**********
print("年龄最大值：\n", max(s.values()))  # todo
print("平均年龄：\n", sum(s.values()) // 20)
