'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：在程序中预设一个0-9之间的整数，让用户通过键盘输入所猜的数，如果大于预
      设的数，显示“遗憾，太大了”；小于预设的数，显示“遗憾，太小了”。
      如此循环，直至猜中该数，显示“预测了N次，你猜中了！ ”，其中N是用户输
      入数字的次数。不使用异常处理。输出实例如样张所示。

------------------------------------------------------'''


def main():
    N = 8
    a = eval(input("【请输入一个整数：】"))
    k = 1

    # **********Program**********
    while a != N:
        if a > N:
            print("你输入的数字太大了")
        elif a < N:
            print("你输入的数字太小了")
        else:
            break
            # **********  End  **********

        a = eval(input("【请输入一个整数：】"))
        k += 1
    print("预测{}次，你猜中了！".format(k))


if __name__ == '__main__':
    main()
