'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写fun函数，其功能为根据整型形参m，计算如下公式
      的值：y=1/2＋1/4＋1/6＋...＋1/2m 。

例如：若m=9，则应输出：1.414484

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''


def fun(m):
    # **********Program**********
    s = 0.0
    for i in range(2, 2 * m + 1, 2):
        s += 1 / i
    return s


# **********  End  **********

def main():
    print("【请连续三次计算公式的值：】")
    for n in range(3):
        print("【第%d次：】" % (n + 1))
        m = int(input('【请输入任意正整数m：】'))
        print('【当前结果为：】%.6f' % fun(m))


if __name__ == '__main__':
    main()
